In [2]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='번호')
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

##### 점수가 80이상인 불리언 Series

In [16]:
df[df['점수']>=80]

     이름  주소  나이   점수    언어
번호
2번  이길동  서울  23   88  Java
3번  강길동  대구  30   98   C++
4번  홍길동  대전  20  100   NaN
6번  나길동  서울  25   90     C

In [13]:
df['점수']>=80

번호
1번    False
2번     True
3번     True
4번     True
5번    False
6번     True
Name: 점수, dtype: bool

#### 점수가 80이상 불리언 인덱싱

In [27]:
cond = df['점수']>=80
df[cond]

     이름  주소  나이   점수    언어
번호
2번  이길동  서울  23   88  Java
3번  강길동  대구  30   98   C++
4번  홍길동  대전  20  100   NaN
6번  나길동  서울  25   90     C

In [31]:
~cond, cond

(번호
 1번     True
 2번    False
 3번    False
 4번    False
 5번     True
 6번    False
 Name: 점수, dtype: bool,
 번호
 1번    False
 2번     True
 3번     True
 4번     True
 5번    False
 6번     True
 Name: 점수, dtype: bool)

In [32]:
df[~cond]

     이름  주소  나이  점수      언어
번호
1번  김길동  광주  33  76  Python
5번  박길동  광주  21  60     NaN

#### Not 불리언 인덱싱

In [4]:
df[~cond]

     이름  주소  나이  점수      언어
번호
1번  김길동  광주  33  76  Python
5번  박길동  광주  21  60     NaN

In [5]:
df[df['점수']>=80]

     이름  주소  나이   점수    언어
번호
2번  이길동  서울  23   88  Java
3번  강길동  대구  30   98   C++
4번  홍길동  대전  20  100   NaN
6번  나길동  서울  25   90     C

#### 나이가 25이상인 이름 컬럼

In [33]:
df['나이']>=25

번호
1번     True
2번    False
3번     True
4번    False
5번    False
6번     True
Name: 나이, dtype: bool

In [21]:
df[df['나이']>=25]['이름']

번호
1번    김길동
3번    강길동
6번    나길동
Name: 이름, dtype: object

In [7]:
df.loc[df['나이']>=25, '이름']

번호
1번    김길동
3번    강길동
6번    나길동
Name: 이름, dtype: object

#### 점수가 80이상인 이름, 주소, 언어

In [8]:
df.loc[df['점수']>=80 , ['이름','주소','언어']]

     이름  주소    언어
번호
2번  이길동  서울  Java
3번  강길동  대구   C++
4번  홍길동  대전   NaN
6번  나길동  서울     C

#### 점수가 80이상이고 주소가 서울

In [34]:
df[(df['점수']>=80) & (df['주소']=='서울')]

     이름  주소  나이  점수    언어
번호
2번  이길동  서울  23  88  Java
6번  나길동  서울  25  90     C

In [10]:
df.loc[(df['점수']>=80) & (df['주소']=='서울')]

     이름  주소  나이  점수    언어
번호
2번  이길동  서울  23  88  Java
6번  나길동  서울  25  90     C

In [36]:
df[(df['점수']>=80) & (df['주소']=='서울')]['언어']

번호
2번    Java
6번       C
Name: 언어, dtype: object

In [11]:
df.loc[(df['점수']>=80) & (df['주소']=='서울') , '언어']

번호
2번    Java
6번       C
Name: 언어, dtype: object

In [12]:
df.loc[(df['점수']>=80) & (df['주소']=='서울') , ['이름','언어']]

     이름    언어
번호
2번  이길동  Java
6번  나길동     C

#### 점수가 60미만이거나 95이상

In [13]:
df.loc[(df['점수']<60) | (df['점수']>=95)]

     이름  주소  나이   점수   언어
번호
3번  강길동  대구  30   98  C++
4번  홍길동  대전  20  100  NaN

***

#### str 함수

##### 문자열 데이터에서 시작 문자 검색

In [38]:
cond = df['이름'].str.startswith('박')
df[cond]

     이름  주소  나이  점수   언어
번호
5번  박길동  광주  21  60  NaN

In [14]:
cond = df['이름'].str.startswith('박') # '박'으로 시작하는 것들만 출
df[cond]

     이름  주소  나이  점수   언어
번호
5번  박길동  광주  21  60  NaN

##### 문자열 데이터에서 포함 문자 검색

In [15]:
cond = df['주소'].str.contains('주') # '주'자가 포함된 것들만 출력
df[cond]

     이름  주소  나이  점수      언어
번호
1번  김길동  광주  33  76  Python
5번  박길동  광주  21  60     NaN

In [16]:
df[~cond]

     이름  주소  나이   점수    언어
번호
2번  이길동  서울  23   88  Java
3번  강길동  대구  30   98   C++
4번  홍길동  대전  20  100   NaN
6번  나길동  서울  25   90     C

In [17]:
lang = ['Java','Python']
cond = df['언어'].isin(lang)
df[cond]

     이름  주소  나이  점수      언어
번호
1번  김길동  광주  33  76  Python
2번  이길동  서울  23  88    Java

In [18]:
df[~cond]

     이름  주소  나이   점수   언어
번호
3번  강길동  대구  30   98  C++
4번  홍길동  대전  20  100  NaN
5번  박길동  광주  21   60  NaN
6번  나길동  서울  25   90    C

In [19]:
lang = ['java','python']
cond = df['언어'].isin(lang)
df[cond]

Empty DataFrame
Columns: [이름, 주소, 나이, 점수, 언어]
Index: []

In [21]:
df['언어'].str.lower()

번호
1번    python
2번      java
3번       c++
4번       NaN
5번       NaN
6번         c
Name: 언어, dtype: object

In [22]:
lang = ['java','python']
cond = df['언어'].str.lower().isin(lang)
df[cond]

     이름  주소  나이  점수      언어
번호
1번  김길동  광주  33  76  Python
2번  이길동  서울  23  88    Java

In [24]:
cond = df['언어'].str.contains('Java')
df[cond]

ValueError: Cannot mask with non-boolean array containing NA / NaN values

In [26]:
cond = df['언어'].str.contains('Java', na=False)
df[cond]

     이름  주소  나이  점수    언어
번호
2번  이길동  서울  23  88  Java

***

#### 결측치 : 비어있는 데이터, 삭제하거나 채우거나

In [27]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='번호')
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

#### 결측치 채우기 : fillna

In [28]:
df.fillna('')

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100
5번  박길동  광주  21   60
6번  나길동  서울  25   90       C

In [29]:
import numpy as np
df['주소'] = np.nan

In [30]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동 NaN  33   76  Python
2번  이길동 NaN  23   88    Java
3번  강길동 NaN  30   98     C++
4번  홍길동 NaN  20  100     NaN
5번  박길동 NaN  21   60     NaN
6번  나길동 NaN  25   90       C

In [31]:
df.fillna('모름')

     이름  주소  나이   점수      언어
번호
1번  김길동  모름  33   76  Python
2번  이길동  모름  23   88    Java
3번  강길동  모름  30   98     C++
4번  홍길동  모름  20  100      모름
5번  박길동  모름  21   60      모름
6번  나길동  모름  25   90       C

In [32]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동 NaN  33   76  Python
2번  이길동 NaN  23   88    Java
3번  강길동 NaN  30   98     C++
4번  홍길동 NaN  20  100     NaN
5번  박길동 NaN  21   60     NaN
6번  나길동 NaN  25   90       C

In [34]:
df.fillna('모름', inplace=True)

In [35]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동  모름  33   76  Python
2번  이길동  모름  23   88    Java
3번  강길동  모름  30   98     C++
4번  홍길동  모름  20  100      모름
5번  박길동  모름  21   60      모름
6번  나길동  모름  25   90       C

In [36]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='번호')
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [39]:
df['언어'].fillna('모름', inplace=True)

In [40]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100      모름
5번  박길동  광주  21   60      모름
6번  나길동  서울  25   90       C

#### 결측치 삭제 : dropna

In [42]:
df = pd.read_excel('score.xlsx', index_col='번호')
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [43]:
df.dropna()

     이름  주소  나이  점수      언어
번호
1번  김길동  광주  33  76  Python
2번  이길동  서울  23  88    Java
3번  강길동  대구  30  98     C++
6번  나길동  서울  25  90       C

- axis : index, columns
- how : any, all

In [44]:
df.dropna(axis='index', how='any')

     이름  주소  나이  점수      언어
번호
1번  김길동  광주  33  76  Python
2번  이길동  서울  23  88    Java
3번  강길동  대구  30  98     C++
6번  나길동  서울  25  90       C

In [46]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [47]:
df.dropna(axis='columns', how='any')

     이름  주소  나이   점수
번호
1번  김길동  광주  33   76
2번  이길동  서울  23   88
3번  강길동  대구  30   98
4번  홍길동  대전  20  100
5번  박길동  광주  21   60
6번  나길동  서울  25   90

In [48]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [49]:
df.dropna(axis='index', how='all')

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [50]:
df['주소'] = np.nan
df

     이름  주소  나이   점수      언어
번호
1번  김길동 NaN  33   76  Python
2번  이길동 NaN  23   88    Java
3번  강길동 NaN  30   98     C++
4번  홍길동 NaN  20  100     NaN
5번  박길동 NaN  21   60     NaN
6번  나길동 NaN  25   90       C

In [51]:
df.dropna(axis='columns', how='all')

     이름  나이   점수      언어
번호
1번  김길동  33   76  Python
2번  이길동  23   88    Java
3번  강길동  30   98     C++
4번  홍길동  20  100     NaN
5번  박길동  21   60     NaN
6번  나길동  25   90       C

In [52]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동 NaN  33   76  Python
2번  이길동 NaN  23   88    Java
3번  강길동 NaN  30   98     C++
4번  홍길동 NaN  20  100     NaN
5번  박길동 NaN  21   60     NaN
6번  나길동 NaN  25   90       C

In [53]:
df.dropna(axis='columns')

     이름  나이   점수
번호
1번  김길동  33   76
2번  이길동  23   88
3번  강길동  30   98
4번  홍길동  20  100
5번  박길동  21   60
6번  나길동  25   90